In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [34]:
df1=pd.read_csv("D:\DataML\hiring.csv")

In [35]:
df1

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [37]:
df1['experience']=df1['experience'].fillna('zero')
df1

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [38]:
df1['test_score(out of 10)'] = pd.to_numeric(df1['test_score(out of 10)'], errors='coerce')
mean_value = df1['test_score(out of 10)'].mean()
df1['test_score(out of 10)'].fillna(mean_value, inplace=True)
mean_value

7.857142857142857

In [39]:
import math
mean_val=math.floor(mean_value)
mean_val

7

In [43]:
df1['test_score(out of 10)']=df1['test_score(out of 10)'].fillna(mean_val)
df1

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero               8.000000                           9      50000
1       zero               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

In [41]:
!pip install word2number

Collecting word2number

[notice] A new release of pip available: 22.3.1 -> 23.3.2
[notice] To update, run: python.exe -m pip install --upgrade pip

  Downloading word2number-1.1.zip (9.7 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py): started
  Building wheel for word2number (setup.py): finished with status 'done'
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5589 sha256=2d9111a2ca750b706b2a5fb18ed12fd05a090041863def6d2407c234cbd7b458
  Stored in directory: c:\users\dell\appdata\local\pip\cache\wheels\04\4b\7e\2f2c026616da4be6b92f9c981d05e9a3ad6e862da305e1dda3
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1

In [45]:
from word2number import w2n
df1['experience'] = df['experience'].apply(w2n.word_to_num)

In [46]:
df1

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0               8.000000                           9      50000
1           0               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

In [48]:
df1['test_score(out of 10)'] = df1['test_score(out of 10)'].astype(int)

In [49]:
df1

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                      8                           9      50000
1           0                      8                           6      45000
2           5                      6                           7      60000
3           2                     10                          10      65000
4           7                      9                           6      70000
5           3                      7                          10      62000
6          10                      7                           7      72000
7          11                      7                           8      80000

In [50]:
reg=linear_model.LinearRegression()
reg.fit(df1[['experience','test_score(out of 10)','interview_score(out of 10)']],df['salary($)'])

LinearRegression()

In [51]:
reg.predict([[2,9,6]])

C:\Users\DELL\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53713.86677124])

In [52]:
reg.predict([[12,10,10]])

C:\Users\DELL\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([93747.79628651])